/*
头文件：
	菜单
	包含各种各样的菜单
*/
#ifndef Meun_
#define Meun_

#include <sstream>
#include <iostream>
using namespace std;
/*
类：
	菜单
*/
class Meun
{
public:
	// 类方法：请输入数字来进行下一步操作
	void Next()
	{
		cout
			<< "请输入数字来进行下一步操作：";
	}
	// 类方法：输出登陆菜单
	void Land()
	{
		cout
			<< "+-----------------------------------------------+" << endl
			<< "|          欢迎使用学生管理系统，请登陆         |" << endl
			<< "+-----------------------------------------------+" << endl
			<< "|1.我没有账号                                   |" << endl
			<< "|2.我已有账号，直接登陆                         |" << endl
			<< "+-----------------------------------------------+" << endl
			<< "|0.退出 （注意输入非数字字符或字符串也会退出）  |" << endl
			<< "+-----------------------------------------------+" << endl;
	}
	// 类方法：输出注册菜单
	void Register()
	{
		cout
			<< "+-----------------------------------------------+" << endl
			<< "|          欢迎使用学生管理系统，请注册         |" << endl
			<< "+-----------------------------------------------+" << endl
			<< "|请依次输入账号密码                             |" << endl
			<< "+-----------------------------------------------+" << endl;
	}
	// 类方法：输出阅览者菜单
	void MainOfVisitor()
	{
		cout
			<< "+-----------------------------------------------+" << endl
			<< "|          空                                   |" << endl
			<< "+-----------------------------------------------+" << endl;
	}
	// 类方法：输出管理员菜单
	void MainOfAdministrators(string Name)
	{
		cout
			<< "欢迎您，" << Name << "！" << endl
			<< "+-----------------------------------------------+" << endl
			<< "|          欢迎使用学生管理系统，请选择         |" << endl
			<< "+-----------------------------------------------+" << endl
			<< "|1.查看所有数据         |6.输出并保存所有数据   |" << endl
			<< "|2.创建一个学生         |                       |" << endl
			<< "|3.寻找一个学生         |                       |" << endl
			<< "|4.修改一个学生         |                       |" << endl
			<< "|5.删除一个学生         |                       |" << endl
			<< "+-----------------------------------------------+" << endl;
	}
};
#endif